In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
col=['A','B','C',"D"]
index=['Acct','Eco','Eng','IP','Math']
data=[[99,94,92,99],[94,94,92,97],[95,89,91,89],[94,87,99,94],[97,100,99,99]]
d=pd.DataFrame(data=data,columns=col,index=index)
d.dtypes
d.shape
d.size
d.ndim

2

In [7]:
d

       A    B   C   D
Acct  99   94  92  99
Eco   94   94  92  97
Eng   95   89  91  89
IP    94   87  99  94
Math  97  100  99  99

In [13]:
d.mode()

      A     B   C     D
0  94.0  94.0  92  99.0
1   NaN   NaN  99   NaN

In [15]:
print(d.mode(axis=1))

       0
Acct  99
Eco   94
Eng   89
IP    94
Math  99

In [16]:
d.mean()

A    95.8
B    92.8
C    94.6
D    95.6
dtype: float64

In [18]:
d.median()

A    95.0
B    94.0
C    92.0
D    97.0
dtype: float64

In [19]:
d.count()

A    5
B    5
C    5
D    5
dtype: int64